analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
/*
 * Copyright (c) 2025-2026 Analog Devices, Inc.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "stm32_capi_uart_priv.h"
#include "capi_alloc.h"
#include <errno.h>
#include <sys/stat.h>
#include <stdio.h>

/** Maximum number of UART instances tracked for HAL callback routing.
 * 12 covers all known STM32 families (up to 10 on H7/H5, plus headroom). */
#define STM32_CAPI_UART_MAX_INSTANCES 12

/** Lookup table: maps HAL UART handle → CAPI handle for ISR dispatch */
static struct capi_uart_handle *uart_handle_map[STM32_CAPI_UART_MAX_INSTANCES];
static UART_HandleTypeDef *uart_hal_map[STM32_CAPI_UART_MAX_INSTANCES];

static void uart_map_register(UART_HandleTypeDef *huart,
			      struct capi_uart_handle *handle)
{
	unsigned int i;

	for (i = 0; i < STM32_CAPI_UART_MAX_INSTANCES; i++) {
		if (!uart_hal_map[i] || uart_hal_map[i] == huart) {
			uart_hal_map[i] = huart;
			uart_handle_map[i] = handle;
			return;
		}
	}
}

static void uart_map_unregister(UART_HandleTypeDef *huart)
{
	unsigned int i;

	for (i = 0; i < STM32_CAPI_UART_MAX_INSTANCES; i++) {
		if (uart_hal_map[i] == huart) {
			uart_hal_map[i] = NULL;
			uart_handle_map[i] = NULL;
			return;
		}
	}
}

static struct capi_uart_handle *uart_map_lookup(UART_HandleTypeDef *huart)
{
	unsigned int i;

	for (i = 0; i < STM32_CAPI_UART_MAX_INSTANCES; i++) {
		if (uart_hal_map[i] == huart)
			return uart_handle_map[i];
	}
	return NULL;
}

/**
 * @brief Initialize the STM32 UART peripheral.
 * @param handle - Pointer to the UART handle to be allocated and initialized.
 * @param config - Pointer to the UART configuration structure.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_init(struct capi_uart_handle **handle,
				const struct capi_uart_config *config)
{
	struct capi_uart_handle *uart_handle;
	struct stm32_uart_priv_handle *uart_priv_handle;
	struct stm32_uart_extra_config *uart_extra_config;
	int ret = 0;

	if (!handle || !config || !config->extra)
		return -EINVAL;

	if (*handle == NULL) {
		uart_handle = (struct capi_uart_handle *)capi_calloc(1, sizeof(*uart_handle));
		if (!uart_handle)
			return -ENOMEM;

		uart_priv_handle = (struct stm32_uart_priv_handle *)capi_calloc(1,
				   sizeof(*uart_priv_handle));
		if (!uart_priv_handle) {
			capi_free(uart_handle);
			return -ENOMEM;
		}

		uart_handle->priv = uart_priv_handle;
		uart_handle->init_allocated = true;
	} else {
		uart_handle = *handle;
		uart_handle->init_allocated = false;

		if (!uart_handle->priv)
			return -EINVAL;

		uart_priv_handle = uart_handle->priv;
	}
	uart_handle->ops = config->ops;

	uart_extra_config = config->extra;

	uart_priv_handle->huart = uart_extra_config->huart;

	uart_priv_handle->huart->Init.BaudRate = config->line_config->baudrate;

	switch (config->line_config->size) {
#ifdef UART_WORDLENGTH_7B
	case CAPI_UART_DATA_BITS_7:
		uart_priv_handle->huart->Init.WordLength = UART_WORDLENGTH_7B;
		break;
#endif
	case CAPI_UART_DATA_BITS_8:
		uart_priv_handle->huart->Init.WordLength = UART_WORDLENGTH_8B;
		break;
	/* TODO: add 9 bits option to CAPI */
	/* case CAPI_UART_DATA_BITS_9:
		uart_priv_handle->huart->Init.WordLength = UART_WORDLENGTH_9B;
		break; */
	default:
		ret = -EINVAL;
		goto error;
	};

	switch (config->line_config->parity) {
	case CAPI_UART_PARITY_NONE:
		uart_priv_handle->huart->Init.Parity = UART_PARITY_NONE;
		break;
	case CAPI_UART_PARITY_ODD:
		uart_priv_handle->huart->Init.Parity = UART_PARITY_ODD;
		break;
	case CAPI_UART_PARITY_EVEN:
		uart_priv_handle->huart->Init.Parity = UART_PARITY_EVEN;
		break;
	default:
		ret = -EINVAL;
		goto error;
	};

	uart_priv_handle->huart->Init.StopBits =
		config->line_config->stop_bits == CAPI_UART_STOP_1_BIT ?
		UART_STOPBITS_1 : UART_STOPBITS_2;

	uart_priv_handle->huart->Init.Mode = uart_extra_config->huart->Init.Mode;
	uart_priv_handle->huart->Init.HwFlowCtl =
		uart_extra_config->huart->Init.HwFlowCtl;
	uart_priv_handle->huart->Init.OverSampling =
		uart_extra_config->huart->Init.OverSampling;

	ret = HAL_UART_Init(uart_priv_handle->huart);
	if (ret != HAL_OK) {
		ret = -EIO;
		goto error;
	}

	*handle = uart_handle;

	uart_map_register(uart_priv_handle->huart, uart_handle);

	return 0;
error:
	if (uart_handle->init_allocated) {
		capi_free(uart_priv_handle);
		capi_free(uart_handle);
	}

	return ret;
}

/**
 * @brief Deinitialize the STM32 UART peripheral and free resources.
 * @param handle - Pointer to the UART handle.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_deinit(struct capi_uart_handle *handle)
{
	struct stm32_uart_priv_handle *uart_priv_handle;

	if (!handle)
		return -EINVAL;

	uart_priv_handle = handle->priv;

	if (uart_priv_handle) {
		uart_map_unregister(uart_priv_handle->huart);
		HAL_UART_DeInit(uart_priv_handle->huart);
	}

	if (handle->init_allocated) {
		capi_free(uart_priv_handle);
		capi_free(handle);
	}

	return 0;
}

/**
 * @brief Get the current UART line configuration from the STM32 HAL handle.
 * @param handle - Pointer to the UART handle.
 * @param line_config - Pointer to the structure to fill with current config.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_get_line_config(struct capi_uart_handle *handle,
		struct capi_uart_line_config *line_config)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !line_config)
		return -EINVAL;

	priv = handle->priv;

	line_config->baudrate = priv->huart->Init.BaudRate;

	switch (priv->huart->Init.WordLength) {
#ifdef UART_WORDLENGTH_7B
	case UART_WORDLENGTH_7B:
		line_config->size = CAPI_UART_DATA_BITS_7;
		break;
#endif
	case UART_WORDLENGTH_8B:
		line_config->size = CAPI_UART_DATA_BITS_8;
		break;
	default:
		line_config->size = CAPI_UART_DATA_BITS_8;
		break;
	}

	switch (priv->huart->Init.Parity) {
	case UART_PARITY_ODD:
		line_config->parity = CAPI_UART_PARITY_ODD;
		break;
	case UART_PARITY_EVEN:
		line_config->parity = CAPI_UART_PARITY_EVEN;
		break;
	default:
		line_config->parity = CAPI_UART_PARITY_NONE;
		break;
	}

	line_config->stop_bits = (priv->huart->Init.StopBits == UART_STOPBITS_2) ?
				 CAPI_UART_STOP_2_BIT : CAPI_UART_STOP_1_BIT;

	switch (priv->huart->Init.HwFlowCtl) {
	case UART_HWCONTROL_RTS:
		line_config->flow_control = CAPI_UART_FLOW_CONTROL_RTS;
		break;
	case UART_HWCONTROL_CTS:
		line_config->flow_control = CAPI_UART_FLOW_CONTROL_CTS;
		break;
	case UART_HWCONTROL_RTS_CTS:
		line_config->flow_control = CAPI_UART_FLOW_CONTROL_RTSCTS;
		break;
	default:
		line_config->flow_control = CAPI_UART_FLOW_CONTROL_NONE;
		break;
	}

	line_config->address_mode = CAPI_UART_ADDRESS_MODE_DISABLED;
	line_config->device_address = 0;
	line_config->sticky_parity = false;
	line_config->loopback = false;

