analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
	return 0;
}

/**
 * @brief Set a new UART line configuration on the STM32 peripheral.
 * @param handle - Pointer to the UART handle.
 * @param line_config - Pointer to the new line configuration to apply.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_set_line_config(struct capi_uart_handle *handle,
		struct capi_uart_line_config *line_config)
{
	struct stm32_uart_priv_handle *priv;
	int ret;

	if (!handle || !handle->priv || !line_config)
		return -EINVAL;

	priv = handle->priv;

	priv->huart->Init.BaudRate = line_config->baudrate;

	switch (line_config->size) {
#ifdef UART_WORDLENGTH_7B
	case CAPI_UART_DATA_BITS_7:
		priv->huart->Init.WordLength = UART_WORDLENGTH_7B;
		break;
#endif
	case CAPI_UART_DATA_BITS_8:
		priv->huart->Init.WordLength = UART_WORDLENGTH_8B;
		break;
	default:
		return -EINVAL;
	}

	switch (line_config->parity) {
	case CAPI_UART_PARITY_NONE:
		priv->huart->Init.Parity = UART_PARITY_NONE;
		break;
	case CAPI_UART_PARITY_ODD:
		priv->huart->Init.Parity = UART_PARITY_ODD;
		break;
	case CAPI_UART_PARITY_EVEN:
		priv->huart->Init.Parity = UART_PARITY_EVEN;
		break;
	default:
		return -EINVAL;
	}

	priv->huart->Init.StopBits = (line_config->stop_bits == CAPI_UART_STOP_2_BIT) ?
				     UART_STOPBITS_2 : UART_STOPBITS_1;

	switch (line_config->flow_control) {
	case CAPI_UART_FLOW_CONTROL_NONE:
		priv->huart->Init.HwFlowCtl = UART_HWCONTROL_NONE;
		break;
	case CAPI_UART_FLOW_CONTROL_RTS:
		priv->huart->Init.HwFlowCtl = UART_HWCONTROL_RTS;
		break;
	case CAPI_UART_FLOW_CONTROL_CTS:
		priv->huart->Init.HwFlowCtl = UART_HWCONTROL_CTS;
		break;
	case CAPI_UART_FLOW_CONTROL_RTSCTS:
		priv->huart->Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
		break;
	default:
		return -EINVAL;
	}

	ret = HAL_UART_Init(priv->huart);
	if (ret != HAL_OK)
		return -EIO;

	return 0;
}

/**
 * @brief Transmit data over the STM32 UART peripheral.
 * @param handle - Pointer to the UART handle.
 * @param buf - Pointer to the data buffer to transmit.
 * @param len - Number of bytes to transmit.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_transmit(struct capi_uart_handle *handle,
				    uint8_t *buf, uint32_t len)
{
	struct stm32_uart_priv_handle *uart_priv_handle;
	int ret;

	if (!handle || !handle->priv || !buf)
		return -EINVAL;

	if (!len)
		return 0;

	uart_priv_handle = handle->priv;

	ret = HAL_UART_Transmit(uart_priv_handle->huart, buf, len, HAL_MAX_DELAY);
	switch (ret) {
	case HAL_OK:
		break;
	case HAL_BUSY:
		return -EBUSY;
	case HAL_TIMEOUT:
		return -ETIMEDOUT;
	default:
		return -EIO;
	};

	return 0;
}

/**
 * @brief Receive data from the STM32 UART peripheral.
 * @param handle - Pointer to the UART handle.
 * @param buf - Pointer to the buffer to store received data.
 * @param len - Number of bytes to receive.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_receive(struct capi_uart_handle *handle,
				   uint8_t *buf, uint32_t len)
{
	struct stm32_uart_priv_handle *uart_priv_handle;
	int ret;

	if (!handle || !handle->priv || !buf)
		return -EINVAL;

	if (!len)
		return 0;

	uart_priv_handle = handle->priv;

	ret = HAL_UART_Receive(uart_priv_handle->huart, buf, len, HAL_MAX_DELAY);
	switch (ret) {
	case HAL_OK:
		break;
	case HAL_BUSY:
		return -EBUSY;
	case HAL_TIMEOUT:
		return -ETIMEDOUT;
	default:
		return -EIO;
	};

	return 0;
}

/**
 * @brief Register a user callback for UART async events.
 * @param handle - Pointer to the UART handle.
 * @param callback - User callback function.
 * @param callback_arg - User-provided argument forwarded to the callback.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_register_callback(struct capi_uart_handle *handle,
		capi_uart_callback const callback,
		void *const callback_arg)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;
	priv->callback = callback;
	priv->callback_arg = callback_arg;

	return 0;
}

/**
 * @brief Transmit data asynchronously (interrupt-driven).
 * @param handle - Pointer to the UART handle.
 * @param buf - Pointer to the data buffer to transmit.
 * @param len - Number of bytes to transmit.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_transmit_async(struct capi_uart_handle *handle,
		uint8_t *buf, uint32_t len)
{
	struct stm32_uart_priv_handle *priv;
	int ret;

	if (!handle || !handle->priv || !buf)
		return -EINVAL;

	if (!len)
		return 0;

	priv = handle->priv;

	ret = HAL_UART_Transmit_IT(priv->huart, buf, (uint16_t)len);
	switch (ret) {
	case HAL_OK:
		return 0;
	case HAL_BUSY:
		return -EBUSY;
	default:
		return -EIO;
	}
}

/**
 * @brief Receive data asynchronously (interrupt-driven).
 * @param handle - Pointer to the UART handle.
 * @param buf - Pointer to the buffer for incoming data.
 * @param len - Number of bytes to receive.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_receive_async(struct capi_uart_handle *handle,
		uint8_t *buf, uint32_t len)
{
	struct stm32_uart_priv_handle *priv;
	int ret;

	if (!handle || !handle->priv || !buf)
		return -EINVAL;

	if (!len)
		return 0;

	priv = handle->priv;

	ret = HAL_UART_Receive_IT(priv->huart, buf, (uint16_t)len);
	switch (ret) {
	case HAL_OK:
		return 0;
	case HAL_BUSY:
		return -EBUSY;
	default:
		return -EIO;
	}
}

/**
 * @brief Get the reason for the most recent UART interrupt.
 * @param handle - Pointer to the UART handle.
 * @param reason - Output: the interrupt reason.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_get_interrupt_reason(
	struct capi_uart_handle *handle,
	enum capi_uart_interrupt_reason *reason)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !reason)
		return -EINVAL;

	priv = handle->priv;
	*reason = priv->last_interrupt_reason;

	return 0;
}

/**
 * @brief Get accumulated line status flags.
 * @param handle - Pointer to the UART handle.
 * @param status_flags - Output: bitmask of capi_uart_line_status_flags.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_uart_get_line_status(struct capi_uart_handle *handle,
		uint32_t *status_flags)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !status_flags)
		return -EINVAL;

	priv = handle->priv;
	*status_flags = priv->last_line_status;
	priv->last_line_status = 0;

