analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
	return 0;
}

/*
 * ---------------------------------------------------------------------------
 * FIFO / byte-level / interrupt-control ops.
 *
 * These ops target the whole STM32 UART family through the HAL. Flag reads
 * (TXE/RXNE/TC via __HAL_UART_GET_FLAG) and interrupt controls are identical
 * across families; only the raw data-register access differs between the two
 * USART generations and is bracketed on USART_RDR_RDR / USART_TDR_TDR:
 *   - new generation (F0/F3/F7/L0/L4/L5/G0/G4/H7/H5/U5/WB/WL/C0...): separate
 *     ISR/RDR/TDR/RQR registers;
 *   - old generation (F1/F2/F4/L1): a single SR/DR register, no RQR.
 *
 * "FIFO count" collapses to a 0/1 occupancy of the data register: TXE=1 means
 * the TX data register is empty (nothing queued -> 0), RXNE=1 means a byte is
 * waiting (-> 1). On the parts that do have a real hardware FIFO (H7/L4+/G0/
 * G4/H5/U5...) this reports 0/1 rather than the true FIFO depth, which is
 * sufficient for the ready/not-ready semantics these tests rely on.
 * enable_fifo is a no-op success for parity with backends whose FIFO is not
 * switchable.
 * ---------------------------------------------------------------------------
 */

/**
 * @brief Enable/disable the hardware FIFO (no-op on STM32).
 * @param handle - Pointer to the UART handle.
 * @param enable - Requested FIFO state (ignored).
 * @return 0 on success, -EINVAL on a NULL handle.
 *
 * The FIFO is either absent (older parts) or managed by the HAL init config,
 * not toggled here; the call succeeds as a no-op so callers that
 * opportunistically toggle FIFO mode behave the same on every family.
 */
static int stm32_capi_uart_enable_fifo(struct capi_uart_handle *handle,
				       bool enable)
{
	(void)enable;

	if (!handle || !handle->priv)
		return -EINVAL;

	return 0;
}

/**
 * @brief Drain the TX path (wait for transmission complete).
 * @param handle - Pointer to the UART handle.
 * @return 0 on success, -EINVAL on a NULL handle.
 *
 * With no TX FIFO, "flush" means let the last byte leave the shift register.
 * Waits for TC so a following deinit/reconfigure does not truncate output.
 */
static int stm32_capi_uart_flush_tx_fifo(struct capi_uart_handle *handle)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

	while (!__HAL_UART_GET_FLAG(priv->huart, UART_FLAG_TC))
		;

	return 0;
}

/**
 * @brief Discard any pending received data.
 * @param handle - Pointer to the UART handle.
 * @return 0 on success, -EINVAL on a NULL handle.
 *
 * Issues the RX-data flush request and clears the overrun flag so a stale byte
 * or a latched overrun left by a previous transfer cannot leak into the next
 * receive.
 */
static int stm32_capi_uart_flush_rx_fifo(struct capi_uart_handle *handle)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

#if defined(USART_RDR_RDR)
	/* New-generation USART (ISR/RDR/TDR/RQR). */
	__HAL_UART_SEND_REQ(priv->huart, UART_RXDATA_FLUSH_REQUEST);
	__HAL_UART_CLEAR_OREFLAG(priv->huart);
#else
	/*
	 * Old-generation USART (SR/DR, no RQR): there is no flush request.
	 * Reading DR pops any waiting byte and clears RXNE, and the canonical
	 * read-SR-then-read-DR sequence clears a latched overrun (ORE).
	 */
	{
		volatile uint32_t tmp;

		tmp = priv->huart->Instance->SR;
		tmp = priv->huart->Instance->DR;
		(void)tmp;
	}
#endif

	return 0;
}

/**
 * @brief Report RX data-register occupancy (0 or 1).
 * @param handle - Pointer to the UART handle.
 * @param count - Output: 1 if a byte is waiting in RDR, else 0.
 * @return 0 on success, -EINVAL on a NULL argument.
 */
static int stm32_capi_uart_get_rx_fifo_count(struct capi_uart_handle *handle,
		uint16_t *count)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !count)
		return -EINVAL;

	priv = handle->priv;
	*count = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_RXNE) ? 1U : 0U;

	return 0;
}

/**
 * @brief Report TX data-register occupancy (0 or 1).
 * @param handle - Pointer to the UART handle.
 * @param count - Output: 0 if TDR is empty (TXE), else 1 byte still queued.
 * @return 0 on success, -EINVAL on a NULL argument.
 */
static int stm32_capi_uart_get_tx_fifo_count(struct capi_uart_handle *handle,
		uint16_t *count)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !count)
		return -EINVAL;

	priv = handle->priv;
	*count = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_TXE) ? 0U : 1U;

	return 0;
}

/**
 * @brief Non-blocking single-byte read from RDR.
 * @param handle - Pointer to the UART handle.
 * @param byte - Output: the byte read (untouched when none is available).
 * @return 1 if a byte was read, 0 if RDR was empty or on a NULL argument.
 */
static uint32_t stm32_capi_uart_read_byte(struct capi_uart_handle *handle,
		uint8_t *byte)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !byte)
		return 0U;

	priv = handle->priv;

	if (!__HAL_UART_GET_FLAG(priv->huart, UART_FLAG_RXNE))
		return 0U;

#if defined(USART_RDR_RDR)
	*byte = (uint8_t)(priv->huart->Instance->RDR & 0xFFU);
#else
	*byte = (uint8_t)(priv->huart->Instance->DR & 0xFFU);
#endif

	return 1U;
}

/**
 * @brief Non-blocking single-byte write to TDR.
 * @param handle - Pointer to the UART handle.
 * @param byte - Byte to transmit.
 * @return 1 if the byte was queued, 0 if TDR was full or on a NULL handle.
 */
static uint32_t stm32_capi_uart_write_byte(struct capi_uart_handle *handle,
		uint8_t byte)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return 0U;

	priv = handle->priv;

	if (!__HAL_UART_GET_FLAG(priv->huart, UART_FLAG_TXE))
		return 0U;

#if defined(USART_TDR_TDR)
	priv->huart->Instance->TDR = (uint16_t)byte;
#else
	priv->huart->Instance->DR = (uint16_t)(byte & 0x1FFU);
#endif

	return 1U;
}

/**
 * @brief Enable or disable the TX-data-register-empty interrupt.
 * @param handle - Pointer to the UART handle.
 * @param enable - true to enable, false to disable.
 * @return 0 on success, -EINVAL on a NULL handle.
 */
static int stm32_capi_uart_set_irq_tx(struct capi_uart_handle *handle,
				      bool enable)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

	if (enable)
		__HAL_UART_ENABLE_IT(priv->huart, UART_IT_TXE);
	else
		__HAL_UART_DISABLE_IT(priv->huart, UART_IT_TXE);

