analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
	return 0;
}

/**
 * @brief Report whether TDR can accept a new byte.
 * @param handle - Pointer to the UART handle.
 * @param ready - Output: true if TXE is set.
 * @return 0 on success, -EINVAL on a NULL argument.
 */
static int stm32_capi_uart_irq_tx_ready(struct capi_uart_handle *handle,
					bool *ready)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !ready)
		return -EINVAL;

	priv = handle->priv;
	*ready = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_TXE) ? true : false;

	return 0;
}

/**
 * @brief Report whether the last transmission has fully completed.
 * @param handle - Pointer to the UART handle.
 * @param complete - Output: true if TC (shift register drained) is set.
 * @return 0 on success, -EINVAL on a NULL argument.
 */
static int stm32_capi_uart_irq_tx_complete(struct capi_uart_handle *handle,
		bool *complete)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !complete)
		return -EINVAL;

	priv = handle->priv;
	*complete = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_TC) ? true : false;

	return 0;
}

/**
 * @brief Enable or disable the RX-data-register-not-empty interrupt.
 * @param handle - Pointer to the UART handle.
 * @param enable - true to enable, false to disable.
 * @return 0 on success, -EINVAL on a NULL handle.
 */
static int stm32_capi_uart_set_irq_rx(struct capi_uart_handle *handle,
				      bool enable)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

	if (enable)
		__HAL_UART_ENABLE_IT(priv->huart, UART_IT_RXNE);
	else
		__HAL_UART_DISABLE_IT(priv->huart, UART_IT_RXNE);

	return 0;
}

/**
 * @brief Report whether a received byte is waiting in RDR.
 * @param handle - Pointer to the UART handle.
 * @param ready - Output: true if RXNE is set.
 * @return 0 on success, -EINVAL on a NULL argument.
 */
static int stm32_capi_uart_irq_rx_ready(struct capi_uart_handle *handle,
					bool *ready)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !ready)
		return -EINVAL;

	priv = handle->priv;
	*ready = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_RXNE) ? true : false;

	return 0;
}

/**
 * @brief Enable or disable the RX error interrupts (parity + frame/noise/overrun).
 * @param handle - Pointer to the UART handle.
 * @param enable - true to enable, false to disable.
 * @return 0 on success, -EINVAL on a NULL handle.
 *
 * PE has its own enable bit; framing, noise and overrun share the single error
 * interrupt (UART_IT_ERR), so both are toggled together.
 */
static int stm32_capi_uart_set_irq_err(struct capi_uart_handle *handle,
				       bool enable)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

	if (enable) {
		__HAL_UART_ENABLE_IT(priv->huart, UART_IT_PE);
		__HAL_UART_ENABLE_IT(priv->huart, UART_IT_ERR);
	} else {
		__HAL_UART_DISABLE_IT(priv->huart, UART_IT_PE);
		__HAL_UART_DISABLE_IT(priv->huart, UART_IT_ERR);
	}

	return 0;
}

/**
 * @brief Report whether any enabled UART interrupt currently has its flag set.
 * @param handle - Pointer to the UART handle.
 * @param pending - Output: true if an enabled source is asserting.
 * @return 0 on success, -EINVAL on a NULL argument.
 *
 * A flag alone is not enough (TXE, for instance, sits high whenever the line is
 * idle); each flag is qualified by its interrupt-enable so the result reflects
 * a genuinely pending interrupt. Framing/noise/overrun share UART_IT_ERR.
 */
static int stm32_capi_uart_is_irq_pending(struct capi_uart_handle *handle,
		bool *pending)
{
	struct stm32_uart_priv_handle *priv;
	UART_HandleTypeDef *huart;
	bool pend = false;

	if (!handle || !handle->priv || !pending)
		return -EINVAL;

	priv = handle->priv;
	huart = priv->huart;

	if (__HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE) &&
	    __HAL_UART_GET_IT_SOURCE(huart, UART_IT_RXNE))
		pend = true;
	if (__HAL_UART_GET_FLAG(huart, UART_FLAG_TXE) &&
	    __HAL_UART_GET_IT_SOURCE(huart, UART_IT_TXE))
		pend = true;
	if (__HAL_UART_GET_FLAG(huart, UART_FLAG_TC) &&
	    __HAL_UART_GET_IT_SOURCE(huart, UART_IT_TC))
		pend = true;
	if (__HAL_UART_GET_FLAG(huart, UART_FLAG_PE) &&
	    __HAL_UART_GET_IT_SOURCE(huart, UART_IT_PE))
		pend = true;
	if ((__HAL_UART_GET_FLAG(huart, UART_FLAG_ORE) ||
	     __HAL_UART_GET_FLAG(huart, UART_FLAG_FE) ||
	     __HAL_UART_GET_FLAG(huart, UART_FLAG_NE)) &&
	    __HAL_UART_GET_IT_SOURCE(huart, UART_IT_ERR))
		pend = true;

	*pending = pend;

	return 0;
}

/**
 * @brief Transmit one 9-bit frame (multi-drop address or data).
 * @param handle - Pointer to the UART handle.
 * @param data - Value to send; only the low 9 bits are used.
 * @param is_address - true to set the 9th (address-mark) bit.
 * @return 0 on success, -EINVAL on a NULL handle, -ENOTSUP if the port is not
 *         configured for a 9-bit word length.
 *
 * 9-bit framing requires the port to have been opened with a 9-bit word length
 * (WordLength_9B); otherwise the 9th bit cannot be expressed and the call is
 * rejected rather than silently truncated.
 */
static int stm32_capi_uart_transmit_9bit(struct capi_uart_handle *handle,
		uint16_t data, bool is_address)
{
	struct stm32_uart_priv_handle *priv;
	uint16_t frame;
	int ret;

	if (!handle || !handle->priv)
		return -EINVAL;

	priv = handle->priv;

	if (priv->huart->Init.WordLength != UART_WORDLENGTH_9B ||
	    priv->huart->Init.Parity != UART_PARITY_NONE)
		return -ENOTSUP;

	frame = (uint16_t)((data & 0xFFU) | (is_address ? 0x100U : 0x000U));

	ret = HAL_UART_Transmit(priv->huart, (uint8_t *)&frame, 1, HAL_MAX_DELAY);
	switch (ret) {
	case HAL_OK:
		break;
	case HAL_BUSY:
		return -EBUSY;
	case HAL_TIMEOUT:
		return -ETIMEDOUT;
	default:
		return -EIO;
	};

	return 0;
}

/**
 * @brief Receive one 9-bit frame (multi-drop address or data).
 * @param handle - Pointer to the UART handle.
 * @param data - Output: the received 9-bit value.
 * @param is_address - Output: true if the 9th (address-mark) bit was set.
 * @return 0 on success, -EINVAL on a NULL argument, -ENOTSUP if the port is not
 *         configured for a 9-bit word length.
 */
static int stm32_capi_uart_receive_9bit(struct capi_uart_handle *handle,
					uint16_t *data, bool *is_address)
{
	struct stm32_uart_priv_handle *priv;
	uint16_t frame;
	int ret;

