analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
	if (!handle || !handle->priv || !data || !is_address)
		return -EINVAL;

	priv = handle->priv;

	if (priv->huart->Init.WordLength != UART_WORDLENGTH_9B ||
	    priv->huart->Init.Parity != UART_PARITY_NONE)
		return -ENOTSUP;

	ret = HAL_UART_Receive(priv->huart, (uint8_t *)&frame, 1, HAL_MAX_DELAY);
	switch (ret) {
	case HAL_OK:
		break;
	case HAL_BUSY:
		return -EBUSY;
	case HAL_TIMEOUT:
		return -ETIMEDOUT;
	default:
		return -EIO;
	};

	*data = (uint16_t)(frame & 0x1FFU);
	*is_address = (frame & 0x100U) ? true : false;

	return 0;
}

/**
 * @brief Manually drive RTS/CTS (not supported on STM32).
 * @return -EINVAL on a NULL handle, otherwise -ENOTSUP.
 *
 * The STM32 USART manages RTS/CTS in hardware when flow control is enabled;
 * there is no register to override the line state by hand, so the request is
 * refused with -ENOTSUP rather than pretending to have applied it.
 */
static int stm32_capi_uart_set_flow_control_state(struct capi_uart_handle
		*handle,
		bool rts_state, bool cts_state)
{
	(void)rts_state;
	(void)cts_state;

	if (!handle || !handle->priv)
		return -EINVAL;

	return -ENOTSUP;
}

/**
 * @brief Read back the RTS/CTS line state.
 * @param handle - Pointer to the UART handle.
 * @param rts_state - Output: unused.
 * @param cts_state - Output: live CTS line level from the status register.
 * @return 0 on success, -EINVAL on a NULL argument.
 *
 * CTS is observable via the status register; the RTS output level is not
 * read-back-able on the STM32 USART, so it is reported as deasserted.
 */
static int stm32_capi_uart_get_flow_control_state(struct capi_uart_handle
		*handle,
		bool *rts_state, bool *cts_state)
{
	struct stm32_uart_priv_handle *priv;

	if (!handle || !handle->priv || !rts_state || !cts_state)
		return -EINVAL;

	priv = handle->priv;

	*rts_state = false;
	*cts_state = __HAL_UART_GET_FLAG(priv->huart, UART_FLAG_CTS) ? true : false;

	return 0;
}

/**
 * @brief UART ISR entry point — delegates to HAL_UART_IRQHandler.
 * @param handle - Pointer to the UART handle (cast from void *).
 */
static void stm32_capi_uart_isr(void *handle)
{
	struct capi_uart_handle *uart_handle = (struct capi_uart_handle *)handle;
	struct stm32_uart_priv_handle *priv;

	if (!uart_handle || !uart_handle->priv)
		return;

	priv = uart_handle->priv;

	HAL_UART_IRQHandler(priv->huart);
}

/*
 * STM32 HAL weak-override callbacks.
 *
 * The HAL calls these from HAL_UART_IRQHandler().  We look up the CAPI
 * handle via the mapping table and forward the event to the user callback.
 */

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	struct capi_uart_handle *handle = uart_map_lookup(huart);
	struct stm32_uart_priv_handle *priv;

	if (!handle)
		return;

	priv = handle->priv;
	if (priv->callback)
		priv->callback(CAPI_UART_EVENT_TX_DONE, priv->callback_arg, 0);
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	struct capi_uart_handle *handle = uart_map_lookup(huart);
	struct stm32_uart_priv_handle *priv;

	if (!handle)
		return;

	priv = handle->priv;
	if (priv->callback)
		priv->callback(CAPI_UART_EVENT_RX_DONE, priv->callback_arg, 0);
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	struct capi_uart_handle *handle = uart_map_lookup(huart);
	struct stm32_uart_priv_handle *priv;
	uint32_t error;

	if (!handle)
		return;

	priv = handle->priv;
	error = huart->ErrorCode;

	/* Map HAL error bits to CAPI line status flags */
	if (error & HAL_UART_ERROR_PE)
		priv->last_line_status |= CAPI_UART_LINE_STAT_PARITY_ERROR;
	if (error & HAL_UART_ERROR_FE)
		priv->last_line_status |= CAPI_UART_LINE_STAT_FRAMING_ERROR;
	if (error & HAL_UART_ERROR_ORE)
		priv->last_line_status |= CAPI_UART_LINE_STAT_OVERRUN_ERROR;

	priv->last_interrupt_reason = CAPI_UART_INTR_RX_LINE_STATUS;

	if (priv->callback)
		priv->callback(CAPI_UART_EVENT_INTERRUPT, priv->callback_arg,
			       (int)error);
}

void HAL_UART_AbortCpltCallback(UART_HandleTypeDef *huart)
{
	struct capi_uart_handle *handle = uart_map_lookup(huart);
	struct stm32_uart_priv_handle *priv;

	if (!handle)
		return;

	priv = handle->priv;
	if (priv->callback)
		priv->callback(CAPI_UART_EVENT_TX_ABORTED, priv->callback_arg,
			       0);
}

const struct capi_uart_ops stm32_capi_uart_ops = {
	.init = stm32_capi_uart_init,
	.deinit = stm32_capi_uart_deinit,
	.get_line_config = stm32_capi_uart_get_line_config,
	.set_line_config = stm32_capi_uart_set_line_config,
	.transmit = stm32_capi_uart_transmit,
	.receive = stm32_capi_uart_receive,
	.register_callback = stm32_capi_uart_register_callback,
	.transmit_async = stm32_capi_uart_transmit_async,
	.receive_async = stm32_capi_uart_receive_async,
	.get_interrupt_reason = stm32_capi_uart_get_interrupt_reason,
	.get_line_status = stm32_capi_uart_get_line_status,
	.enable_fifo = stm32_capi_uart_enable_fifo,
	.flush_tx_fifo = stm32_capi_uart_flush_tx_fifo,
	.flush_rx_fifo = stm32_capi_uart_flush_rx_fifo,
	.get_rx_fifo_count = stm32_capi_uart_get_rx_fifo_count,
	.get_tx_fifo_count = stm32_capi_uart_get_tx_fifo_count,
	.transmit_9bit = stm32_capi_uart_transmit_9bit,
	.receive_9bit = stm32_capi_uart_receive_9bit,
	.set_flow_control_state = stm32_capi_uart_set_flow_control_state,
	.get_flow_control_state = stm32_capi_uart_get_flow_control_state,
	.read_byte = stm32_capi_uart_read_byte,
	.write_byte = stm32_capi_uart_write_byte,
	.set_irq_tx = stm32_capi_uart_set_irq_tx,
	.irq_tx_ready = stm32_capi_uart_irq_tx_ready,
	.irq_tx_complete = stm32_capi_uart_irq_tx_complete,
	.set_irq_rx = stm32_capi_uart_set_irq_rx,
	.irq_rx_ready = stm32_capi_uart_irq_rx_ready,
	.set_irq_err = stm32_capi_uart_set_irq_err,
	.is_irq_pending = stm32_capi_uart_is_irq_pending,
	.isr = stm32_capi_uart_isr,
};

static struct capi_uart_handle *uart_stdio_handle = NULL;

/**
 * @brief Enable stdio redirection over the STM32 UART peripheral.
 * @param handle - Pointer to an initialized UART handle.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_uart_stdio_enable(struct capi_uart_handle *handle)
{
	if (!handle)
		return -EINVAL;

