analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_uart.c
	uart_stdio_handle = handle;

	/* Disable I/O buffering for STDOUT stream, so that
	* chars are sent out as soon as they are printed. */
	setvbuf(stdout, NULL, _IONBF, 0);

	return 0;
}

#define STDIN_FILENO  0
#define STDOUT_FILENO 1
#define STDERR_FILENO 2

/**
 * @brief Check if a file descriptor refers to a terminal.
 * @param fd - File descriptor to check.
 * @return 1 if the descriptor is a terminal, 0 otherwise.
 */
int _isatty(int fd)
{
	if (fd >= STDIN_FILENO && fd <= STDERR_FILENO)
		return 1;

	errno = EBADF;
	return 0;
}

/**
 * @brief Write data to a file descriptor.
 * @param fd - File descriptor to write to.
 * @param ptr - Pointer to the data buffer.
 * @param len - Number of bytes to write.
 * @return Number of bytes written on success, -1 on error.
 */
int _write(int fd, char *ptr, int len)
{
	int ret;

	if (fd == STDOUT_FILENO || fd == STDERR_FILENO) {
		ret = stm32_capi_uart_transmit(uart_stdio_handle, (uint8_t *)ptr, len);
		if (ret < 0) {
			errno = -ret;
			return -1;
		}

		return len;
	}
	errno = EBADF;
	return -1;
}

/**
 * @brief Close a file descriptor.
 * @param fd - File descriptor to close.
 * @return 0 on success, -1 on error.
 */
int _close(int fd)
{
	if (fd >= STDIN_FILENO && fd <= STDERR_FILENO)
		return 0;

	errno = EBADF;
	return -1;
}

/**
 * @brief Reposition file descriptor offset.
 * @param fd - File descriptor.
 * @param ptr - Offset value.
 * @param dir - Seek direction.
 * @return -1 always, seeking is not supported.
 */
int _lseek(int fd, int ptr, int dir)
{
	(void) fd;
	(void) ptr;
	(void) dir;

	errno = EBADF;
	return -1;
}

/**
 * @brief Read data from a file descriptor.
 * @param fd - File descriptor to read from.
 * @param ptr - Pointer to the buffer for incoming data.
 * @param len - Number of bytes to read.
 * @return Number of bytes read on success, -1 on error.
 */
int _read(int fd, char *ptr, int len)
{
	int ret;

	if (fd == STDIN_FILENO) {
		ret = stm32_capi_uart_receive(uart_stdio_handle, (uint8_t *)ptr, 1);
		if (ret < 0) {
			errno = -ret;
			return -1;
		}

		return 1;
	}
	errno = EBADF;
	return -1;
}

/**
 * @brief Get file status.
 * @param fd - File descriptor.
 * @param st - Pointer to the stat structure to fill.
 * @return 0 on success, -1 on error.
 */
int _fstat(int fd, struct stat *st)
{
	if (fd >= STDIN_FILENO && fd <= STDERR_FILENO) {
		st->st_mode = S_IFCHR;
		return 0;
	}

	errno = EBADF;
	return 0;
}
